<!-- placeholder-1 -->
```fish
terraform plan -chdir=.
```
<!-- placeholder-2 -->

<details><summary>Diff of 14 changes.</summary>

```diff
! module.iam.aws_iam_role_policy.github_actions_test will be updated in-place
- module.iam.google_project_service.required_apis["cloudresourcemanager.googleapis.com"] will be destroyed
# (because google_project_service.required_apis is not in configuration)
- module.iam.google_project_service.required_apis["iam.googleapis.com"] will be destroyed
# (because google_project_service.required_apis is not in configuration)
- module.iam.google_project_service.required_apis["iamcredentials.googleapis.com"] will be destroyed
# (because google_project_service.required_apis is not in configuration)
~ module.instances.data.aws_ami.ubuntu_arm64 will be read during apply
# (depends on a resource or a module with changes pending)
~ module.instances.data.aws_ami.ubuntu_x86_64 will be read during apply
# (depends on a resource or a module with changes pending)
~ module.instances.data.aws_region.current will be read during apply
# (depends on a resource or a module with changes pending)
~ module.instances.data.cloudinit_config.salt_master will be read during apply
# (depends on a resource or a module with changes pending)
- module.instances.aws_route53_record.gcp_validator_node[0] will be destroyed
# (because index [0] is out of range for count)
- module.instances.aws_security_group_rule.salt_master_gcp_validator[0] will be destroyed
# (because index [0] is out of range for count)
- module.instances.aws_security_group_rule.salt_master_gcp_validator_vault[0] will be destroyed
# (because index [0] is out of range for count)
- module.instances.google_compute_disk.validator_data[0] will be destroyed
# (because index [0] is out of range for count)
- module.instances.google_compute_instance.validator[0] will be destroyed
# (because index [0] is out of range for count)
- module.instances.null_resource.salt_minion_provisioner["gcp-validator"] will be destroyed
# (because key ["gcp-validator"] is not in for_each map)
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 0 to add, 1 to change, 9 to destroy.</br>

<!-- placeholder-4 -->
###### By @jmiller0 at 2025-03-09T17:06:44Z [(view log)](https://github.com/jmiller0/terraform-solana/actions/runs/13750659789/job/38451227176#step:7:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.iam.aws_iam_role_policy.github_actions_test will be updated in-place
  ~ resource "aws_iam_role_policy" "github_actions_test" {
        id          = "github-actions-terraform-test:github-actions-test-policy"
        name        = "github-actions-test-policy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                            # (96 unchanged elements hidden)
                            "s3:GetBucketRequestPayment",
                          - "s3:PutBucketRequestPayment",
                            "s3:GetBucketLogging",
                            # (6 unchanged elements hidden)
                            "s3:GetBucketTagging",
                          - "s3:GetLifecycleConfiguration",
                          - "s3:PutLifecycleConfiguration",
                          - "s3:PutBucketNotification",
                          - "s3:GetBucketNotification",
                          - "s3:PutInventoryConfiguration",
                          - "s3:GetInventoryConfiguration",
                          - "s3:PutMetricsConfiguration",
                          - "s3:GetMetricsConfiguration",
                          - "s3:PutAnalyticsConfiguration",
                          - "s3:GetAnalyticsConfiguration",
                          - "s3:PutReplicationConfiguration",
                          - "s3:GetReplicationConfiguration",
                          - "s3:ListBucketVersions",
                          - "s3:GetBucketLocation",
                          - "s3:GetObjectVersion",
                          - "s3:PutObjectVersionAcl",
                          - "s3:GetObjectVersionAcl",
                          - "s3:DeleteObjectVersion",
                          - "s3:GetEncryptionConfiguration",
                          - "s3:PutEncryptionConfiguration",
                          - "s3:GetObjectLockConfiguration",
                          - "s3:PutObjectLockConfiguration",
                          - "s3:GetBucketOwnershipControls",
                          - "s3:PutBucketOwnershipControls",
                          - "s3:GetObjectRetention",
                          - "s3:PutObjectRetention",
                          - "s3:GetObjectLegalHold",
                          - "s3:PutObjectLegalHold",
                          - "s3:BypassGovernanceRetention",
                          - "s3:PutBucketObjectLockConfiguration",
                          - "s3:GetIntelligentTieringConfiguration",
                          - "s3:PutIntelligentTieringConfiguration",
                          - "s3:GetBucketObjectLockConfiguration",
                          - "s3:PutBucketObjectLockConfiguration",
                          - "s3:GetBucketVersioning",
                          - "s3:PutBucketVersioning",
                          - "s3:GetBucketRequestPayment",
                          - "s3:PutBucketRequestPayment",
                          - "s3:GetBucketLogging",
                          - "s3:PutBucketLogging",
                          - "s3:GetBucketPolicy",
                          - "s3:PutBucketPolicy",
                          - "s3:DeleteBucketPolicy",
                          - "s3:GetBucketPolicyStatus",
                            "route53:ListHostedZones",
                            # (21 unchanged elements hidden)
                        ]
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.iam.google_project_service.required_apis["cloudresourcemanager.googleapis.com"] will be destroyed
  # (because google_project_service.required_apis is not in configuration)
  - resource "google_project_service" "required_apis" {
      - disable_dependent_services = false -> null
      - disable_on_destroy         = false -> null
      - id                         = "solval1/cloudresourcemanager.googleapis.com" -> null
      - project                    = "solval1" -> null
      - service                    = "cloudresourcemanager.googleapis.com" -> null
    }

  # module.iam.google_project_service.required_apis["iam.googleapis.com"] will be destroyed
  # (because google_project_service.required_apis is not in configuration)
  - resource "google_project_service" "required_apis" {
      - disable_dependent_services = false -> null
      - disable_on_destroy         = false -> null
      - id                         = "solval1/iam.googleapis.com" -> null
      - project                    = "solval1" -> null
      - service                    = "iam.googleapis.com" -> null
    }

  # module.iam.google_project_service.required_apis["iamcredentials.googleapis.com"] will be destroyed
  # (because google_project_service.required_apis is not in configuration)
  - resource "google_project_service" "required_apis" {
      - disable_dependent_services = false -> null
      - disable_on_destroy         = false -> null
      - id                         = "solval1/iamcredentials.googleapis.com" -> null
      - project                    = "solval1" -> null
      - service                    = "iamcredentials.googleapis.com" -> null
    }

  # module.instances.data.aws_ami.ubuntu_arm64 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ami" "ubuntu_arm64" {
      + architecture          = (known after apply)
      + arn                   = (known after apply)
      + block_device_mappings = (known after apply)
      + boot_mode             = (known after apply)
      + creation_date         = (known after apply)
      + deprecation_time      = (known after apply)
      + description           = (known after apply)
      + ena_support           = (known after apply)
      + hypervisor            = (known after apply)
      + id                    = (known after apply)
      + image_id              = (known after apply)
      + image_location        = (known after apply)
      + image_owner_alias     = (known after apply)
      + image_type            = (known after apply)
      + imds_support          = (known after apply)
      + kernel_id             = (known after apply)
      + most_recent           = true
      + name                  = (known after apply)
      + owner_id              = (known after apply)
      + owners                = [
          + "099720109477",
        ]
      + platform              = (known after apply)
      + platform_details      = (known after apply)
      + product_codes         = (known after apply)
      + public                = (known after apply)
      + ramdisk_id            = (known after apply)
      + root_device_name      = (known after apply)
      + root_device_type      = (known after apply)
      + root_snapshot_id      = (known after apply)
      + sriov_net_support     = (known after apply)
      + state                 = (known after apply)
      + state_reason          = (known after apply)
      + tags                  = (known after apply)
      + tpm_support           = (known after apply)
      + usage_operation       = (known after apply)
      + virtualization_type   = (known after apply)

      + filter {
          + name   = "architecture"
          + values = [
              + "arm64",
            ]
        }
      + filter {
          + name   = "name"
          + values = [
              + "ubuntu/images/hvm-ssd/ubuntu-jammy-22.04-arm64-server-*",
            ]
        }
      + filter {
          + name   = "root-device-type"
          + values = [
              + "ebs",
            ]
        }
      + filter {
          + name   = "virtualization-type"
          + values = [
              + "hvm",
            ]
        }
    }

  # module.instances.data.aws_ami.ubuntu_x86_64 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ami" "ubuntu_x86_64" {
      + architecture          = (known after apply)
      + arn                   = (known after apply)
      + block_device_mappings = (known after apply)
      + boot_mode             = (known after apply)
      + creation_date         = (known after apply)
      + deprecation_time      = (known after apply)
      + description           = (known after apply)
      + ena_support           = (known after apply)
      + hypervisor            = (known after apply)
      + id                    = (known after apply)
      + image_id              = (known after apply)
      + image_location        = (known after apply)
      + image_owner_alias     = (known after apply)
      + image_type            = (known after apply)
      + imds_support          = (known after apply)
      + kernel_id             = (known after apply)
      + most_recent           = true
      + name                  = (known after apply)
      + owner_id              = (known after apply)
      + owners                = [
          + "099720109477",
        ]
      + platform              = (known after apply)
      + platform_details      = (known after apply)
      + product_codes         = (known after apply)
      + public                = (known after apply)
      + ramdisk_id            = (known after apply)
      + root_device_name      = (known after apply)
      + root_device_type      = (known after apply)
      + root_snapshot_id      = (known after apply)
      + sriov_net_support     = (known after apply)
      + state                 = (known after apply)
      + state_reason          = (known after apply)
      + tags                  = (known after apply)
      + tpm_support           = (known after apply)
      + usage_operation       = (known after apply)
      + virtualization_type   = (known after apply)

      + filter {
          + name   = "architecture"
          + values = [
              + "x86_64",
            ]
        }
      + filter {
          + name   = "name"
          + values = [
              + "ubuntu/images/hvm-ssd/ubuntu-jammy-22.04-amd64-server-*",
            ]
        }
      + filter {
          + name   = "root-device-type"
          + values = [
              + "ebs",
            ]
        }
      + filter {
          + name   = "virtualization-type"
          + values = [
              + "hvm",
            ]
        }
    }

  # module.instances.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.instances.data.cloudinit_config.salt_master will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudinit_config" "salt_master" {
      + base64_encode = false
      + boundary      = (known after apply)
      + gzip          = false
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = <<-EOT
                #!/bin/bash
                
                # Log all output
                exec 1> >(logger -s -t $(basename $0)) 2>&1
                
                # Exit on error
                set -e
                
                # Set hostname
                hostnamectl set-hostname salt-master
                echo "salt-master" > /etc/hostname
                echo "127.0.1.1 salt-master" >> /etc/hosts
                
                # Install Salt master
                mkdir -p /etc/apt/keyrings
                curl -fsSL https://packages.broadcom.com/artifactory/api/security/keypair/SaltProjectKey/public | tee /etc/apt/keyrings/salt-archive-keyring.pgp
                curl -fsSL https://github.com/saltstack/salt-install-guide/releases/latest/download/salt.sources | tee /etc/apt/sources.list.d/salt.sources
                
                # Install required packages
                apt-get update
                apt-get install -y salt-master salt-minion python3-pip python3-gnupg awscli jq unzip software-properties-common openssl
                
                # Install Vault
                curl -fsSL https://apt.releases.hashicorp.com/gpg | apt-key add -
                ARCH=$(dpkg --print-architecture)
                apt-add-repository "deb [arch=$ARCH] https://apt.releases.hashicorp.com $(lsb_release -cs) main"
                apt-get update
                apt-get install -y vault
                
                # Create required directories
                mkdir -p /etc/salt/master.d
                mkdir -p /etc/salt/gpgkeys
                mkdir -p /opt/vault/data
                mkdir -p /opt/vault/tls
                
                # Set proper permissions (fix ownership)
                chown -R root:root /etc/salt
                chown -R root:salt /etc/salt/gpgkeys
                chmod 700 /etc/salt/gpgkeys
                chown -R vault:vault /opt/vault
                
                # Configure GPG for Salt master
                cat > /etc/salt/master.d/gpg.conf << EOF
                # GPG configuration for Salt master
                gpg_keydir: /etc/salt/gpgkeys
                EOF
                
                # Set aws_root_zone as a grain
                cat > /etc/salt/grains << EOF
                aws_root_zone: aws.miller.center
                EOF
                
                # Configure GPG renderer for pillar decryption
                cat > /etc/salt/master.d/gpg_renderer.conf << EOF
                # Enable GPG renderer for pillar decryption
                decrypt_pillar_default: gpg
                decrypt_pillar_renderers:
                  - gpg
                EOF
                
                # Generate GPG key for Salt master
                cat > /tmp/gpg_batch << EOF
                %echo Generating GPG key for Salt Master
                Key-Type: RSA
                Key-Length: 2048
                Name-Real: Salt Master
                Name-Email: salt@localhost
                Expire-Date: 0
                %no-protection
                %commit
                %echo Done
                EOF
                
                # Generate GPG key with proper ownership
                gpg --batch --gen-key --homedir /etc/salt/gpgkeys /tmp/gpg_batch
                rm /tmp/gpg_batch
                
                # Fix GPG directory permissions after key generation
                chown -R root:salt /etc/salt/gpgkeys
                chmod -R 700 /etc/salt/gpgkeys
                
                # Generate self-signed TLS cert for Vault
                openssl req -x509 -nodes -days 365 -newkey rsa:2048 \
                  -keyout /opt/vault/tls/tls.key \
                  -out /opt/vault/tls/tls.crt \
                  -subj "/CN=salt-master.aws.miller.center/O=Salt Master/C=US" \
                  -addext "subjectAltName = DNS:salt-master.aws.miller.center,DNS:salt-master,DNS:localhost,IP:127.0.0.1"
                
                chown vault:vault /opt/vault/tls/tls.*
                chmod 600 /opt/vault/tls/tls.key
                chmod 644 /opt/vault/tls/tls.crt
                
                # Basic Salt master configuration
                cat > /etc/salt/master << EOF
                interface: 0.0.0.0
                auto_accept: True
                file_roots:
                  base:
                    - /srv/salt
                pillar_roots:
                  base:
                    - /srv/salt/pillar
                log_level: info
                log_level_logfile: info
                hash_type: sha256
                worker_threads: 5
                timeout: 60
                job_cache: True
                keep_jobs: 24
                EOF
                
                # Install Vault extension
                /opt/saltstack/salt/bin/pip3 install saltext-vault
                
                # Vault configuration with TLS
                cat > /etc/vault.d/vault.hcl << EOF
                storage "file" {
                  path = "/opt/vault/data"
                }
                
                listener "tcp" {
                  address     = "0.0.0.0:8200"
                  tls_cert_file = "/opt/vault/tls/tls.crt"
                  tls_key_file  = "/opt/vault/tls/tls.key"
                }
                
                disable_mlock = true
                ui = true
                api_addr = "https://0.0.0.0:8200"
                EOF
                
                # Configure Salt master to use Vault
                cat > /etc/salt/master.d/vault.conf << EOF
                vault:
                  auth:
                    method: token
                    token_file: /etc/salt/vault_token
                    token_backend: session
                  server:
                    url: https://127.0.0.1:8200
                    verify: /opt/vault/tls/tls.crt
                EOF
                
                #Write minion vault.conf
                cat > /etc/salt/minion.d/vault.conf << EOF
                vault:
                  config_location: master
                  verify: /opt/vault/tls/tls.crt
                EOF
                
                # Write Salt minion configuration
                cat > /etc/salt/minion << EOF
                master: 127.0.0.1
                id: salt-master
                random_id: false
                hash_type: sha256
                EOF
                
                # Write minion_id file explicitly
                echo "salt-master" > /etc/salt/minion_id
                
                # Start services
                systemctl restart salt-master
                systemctl enable salt-master
                systemctl restart vault
                systemctl enable vault
                
                # Initialize Vault
                sleep 5  # Wait for Vault to start
                
                # POC configuration: Using single key for simplicity
                # Production should use multiple keys (e.g., -key-shares=3 -key-threshold=2)
                VAULT_ADDR='https://127.0.0.1:8200' VAULT_SKIP_VERIFY=true vault operator init -key-shares=1 -key-threshold=1 > /root/vault-init.txt
                
                # Store initialization output securely
                chmod 600 /root/vault-init.txt
                
                # Extract root token and save it for Salt
                grep 'Initial Root Token:' /root/vault-init.txt | awk '{print $NF}' > /etc/salt/vault_token
                chmod 600 /etc/salt/vault_token
                chown root:salt /etc/salt/vault_token
                
                # Unseal Vault using the single key (POC only)
                UNSEAL_KEY1=$(grep 'Unseal Key 1:' /root/vault-init.txt | awk '{print $NF}')
                export VAULT_SKIP_VERIFY=true
                VAULT_ADDR='https://127.0.0.1:8200' vault operator unseal $UNSEAL_KEY1
                
                export VAULT_TOKEN=$(cat /etc/salt/vault_token)
                export VAULT_ADDR='https://127.0.0.1:8200'
                
                # Enable AppRole auth method
                vault auth enable approle
                
                # Create AppRole for validators
                vault write auth/approle/role/validator \
                  secret_id_ttl=0 \
                  token_ttl=1h \
                  token_max_ttl=4h \
                  policies=validator-policy,salt_minion_base
                
                # Create AppRole for test minions
                vault write auth/approle/role/gcp-test-minion \
                  secret_id_ttl=0 \
                  token_ttl=24h \
                  token_max_ttl=48h \
                  policies=test-minion-policy,salt_minion_base
                
                # Generate AppRole credentials
                vault read -field=role_id auth/approle/role/validator/role-id > /tmp/role_id.txt
                vault write -f -field=secret_id auth/approle/role/validator/secret-id > /tmp/secret_id.txt
                
                # Encrypt AppRole credentials with GPG
                gpg --homedir /etc/salt/gpgkeys --trust-model always --armor --batch --yes --encrypt --recipient "Salt Master" --output /tmp/role_id.gpg /tmp/role_id.txt
                gpg --homedir /etc/salt/gpgkeys --trust-model always --armor --batch --yes --encrypt --recipient "Salt Master" --output /tmp/secret_id.gpg /tmp/secret_id.txt
                
                # Update approle.sls with encrypted credentials
                cat > /srv/salt/pillar/approle.sls << EOF
                #!yaml|gpg
                
                vault:
                  approle:
                    role_id: |
                $(cat /tmp/role_id.gpg | sed 's/^/      /')
                    secret_id: |
                $(cat /tmp/secret_id.gpg | sed 's/^/      /')
                EOF
                
                # Set proper permissions on pillar files
                chmod 640 /srv/salt/pillar/approle.sls
                chown root:salt /srv/salt/pillar/approle.sls
                
                # Add Vault environment variables to /etc/environment for persistence
                cat >> /etc/environment << EOF
                VAULT_ADDR="https://127.0.0.1:8200"
                VAULT_SKIP_VERIFY=true
                EOF
                
                # Enable KV secrets engine
                vault secrets enable -version=2 kv
                vault secrets enable -path=secret kv
                
                # Create pillar directory with proper permissions
                mkdir -p /srv/salt/pillar/vault
                chown root:salt /srv/salt/pillar/vault
                chmod 750 /srv/salt/pillar/vault
                
                # Now encrypt the certificates and token
                CERT=$(cat /opt/vault/tls/tls.crt)
                KEY=$(cat /opt/vault/tls/tls.key)
                TOKEN=$(cat /etc/salt/vault_token)
                
                # Create temporary files with proper permissions
                install -m 600 /dev/null /tmp/cert.txt
                install -m 600 /dev/null /tmp/key.txt
                install -m 600 /dev/null /tmp/token.txt
                
                echo "$CERT" > /tmp/cert.txt
                echo "$KEY" > /tmp/key.txt
                echo "$TOKEN" > /tmp/token.txt
                
                # Encrypt files with GPG
                gpg --homedir /etc/salt/gpgkeys --trust-model always --armor --batch --yes --encrypt --recipient "Salt Master" --output /tmp/cert.gpg /tmp/cert.txt
                gpg --homedir /etc/salt/gpgkeys --trust-model always --armor --batch --yes --encrypt --recipient "Salt Master" --output /tmp/key.gpg /tmp/key.txt
                gpg --homedir /etc/salt/gpgkeys --trust-model always --armor --batch --yes --encrypt --recipient "Salt Master" --output /tmp/token.gpg /tmp/token.txt
                
                # Create pillar file with encrypted values
                cat > /srv/salt/pillar/vault/certs.sls << EOF
                #!yaml|gpg
                
                vault:
                  tls:
                    cert: |
                $(cat /tmp/cert.gpg | sed 's/^/      /')
                    key: |
                $(cat /tmp/key.gpg | sed 's/^/      /')
                EOF
                
                # Clean up temporary files securely
                shred -u /tmp/cert.txt /tmp/key.txt /tmp/token.txt /tmp/cert.gpg /tmp/key.gpg /tmp/token.gpg /tmp/role_id.txt /tmp/secret_id.txt /tmp/role_id.gpg /tmp/secret_id.gpg
                
                # Final validation
                if ! gpg --list-keys --homedir /etc/salt/gpgkeys | grep -q "Salt Master"; then
                    echo "ERROR: GPG key setup failed"
                    exit 1
                fi
                
                if ! VAULT_SKIP_VERIFY=true vault status | grep -q "Sealed.*false"; then
                    echo "ERROR: Vault is not properly unsealed"
                    exit 1
                fi
                
                if ! systemctl is-active --quiet salt-master; then
                    echo "ERROR: Salt master is not running"
                    exit 1
                fi
                
                systemctl restart salt-master
                systemctl restart salt-minion
                sleep 30
                salt-call state.apply
                
                echo "Salt master and Vault initialization complete. IMPORTANT: Save /root/vault-init.txt securely!"
            EOT
          + content_type = "text/x-shellscript"
          + filename     = "salt-master-init.tpl"
        }
      + part {
          + content      = <<-EOT
                #!/bin/bash
                export VAULT_SKIP_VERIFY=true
                export VAULT_ADDR="https://127.0.0.1:8200"
                export VAULT_TOKEN=$(cat /etc/salt/vault_token)
                      
                # Only process keypairs that exist
                                                                      
                # Only store keypairs that exist
                vault kv put secret/solana/validator \
            EOT
          + content_type = "text/x-shellscript"
          + filename     = "store-keypairs.sh"
        }
    }

  # module.instances.aws_route53_record.gcp_validator_node[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_route53_record" "gcp_validator_node" {
      - fqdn                             = "solana-validator-gcp-0.aws.miller.center" -> null
      - id                               = "Z2QJWI0PQQ7XT5_solana-validator-gcp-0.aws.miller.center_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "solana-validator-gcp-0.aws.miller.center" -> null
      - records                          = [
          - "34.123.170.254",
        ] -> null
      - ttl                              = 300 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z2QJWI0PQQ7XT5" -> null
        # (2 unchanged attributes hidden)
    }

  # module.instances.aws_security_group_rule.salt_master_gcp_validator[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_security_group_rule" "salt_master_gcp_validator" {
      - cidr_blocks            = [
          - "34.123.170.254/32",
        ] -> null
      - description            = "Allow Salt minion ports from GCP validator 0" -> null
      - from_port              = 4505 -> null
      - id                     = "sgrule-3769575426" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-05298503e64116a62" -> null
      - security_group_rule_id = "sgr-0d73b28916afcfffc" -> null
      - self                   = false -> null
      - to_port                = 4506 -> null
      - type                   = "ingress" -> null
    }

  # module.instances.aws_security_group_rule.salt_master_gcp_validator_vault[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_security_group_rule" "salt_master_gcp_validator_vault" {
      - cidr_blocks            = [
          - "34.123.170.254/32",
        ] -> null
      - description            = "Allow Vault access from GCP validator 0" -> null
      - from_port              = 8200 -> null
      - id                     = "sgrule-1647299974" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-05298503e64116a62" -> null
      - security_group_rule_id = "sgr-0119cc5f64c7b2418" -> null
      - self                   = false -> null
      - to_port                = 8200 -> null
      - type                   = "ingress" -> null
    }

  # module.instances.google_compute_disk.validator_data[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "google_compute_disk" "validator_data" {
      - creation_timestamp          = "2025-03-07T08:29:37.491-08:00" -> null
      - disk_id                     = "3802657669238923294" -> null
      - effective_labels            = {
          - "environment" = "testnet"
          - "project"     = "solana"
          - "role"        = "validator"
          - "terraform"   = "true"
        } -> null
      - enable_confidential_compute = false -> null
      - id                          = "projects/solval1/zones/us-central1-a/disks/solana-validator-gcp-0-data" -> null
      - label_fingerprint           = "g7NwHbyogeE=" -> null
      - labels                      = {
          - "environment" = "testnet"
          - "project"     = "solana"
          - "role"        = "validator"
          - "terraform"   = "true"
        } -> null
      - last_attach_timestamp       = "2025-03-07T08:29:52.143-08:00" -> null
      - licenses                    = [] -> null
      - name                        = "solana-validator-gcp-0-data" -> null
      - physical_block_size_bytes   = 4096 -> null
      - project                     = "solval1" -> null
      - provisioned_iops            = 0 -> null
      - provisioned_throughput      = 0 -> null
      - self_link                   = "https://www.googleapis.com/compute/v1/projects/solval1/zones/us-central1-a/disks/solana-validator-gcp-0-data" -> null
      - size                        = 400 -> null
      - terraform_labels            = {
          - "environment" = "testnet"
          - "project"     = "solana"
          - "role"        = "validator"
          - "terraform"   = "true"
        } -> null
      - type                        = "pd-ssd" -> null
      - users                       = [
          - "https://www.googleapis.com/compute/v1/projects/solval1/zones/us-central1-a/instances/solana-validator-gcp-0",
        ] -> null
      - zone                        = "us-central1-a" -> null
        # (12 unchanged attributes hidden)
    }

  # module.instances.google_compute_instance.validator[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "google_compute_instance" "validator" {
      - can_ip_forward             = false -> null
      - cpu_platform               = "AMD Genoa" -> null
      - creation_timestamp         = "2025-03-07T08:29:51.099-08:00" -> null
      - current_status             = "RUNNING" -> null
      - deletion_protection        = false -> null
      - effective_labels           = {} -> null
      - enable_display             = false -> null
      - id                         = "projects/solval1/zones/us-central1-a/instances/solana-validator-gcp-0" -> null
      - instance_id                = "6278765238039257106" -> null
      - label_fingerprint          = "42WmSpB8rSM=" -> null
      - labels                     = {} -> null
      - machine_type               = "c3d-highcpu-60" -> null
      - metadata                   = {
          - "environment" = "testnet"
          - "project"     = "solana"
          - "role"        = "validator"
          - "salt-minion" = "true"
          - "ssh-keys"    = "ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDxfyt3hd6SzeVu+cz8lG89JE2LBtwea1mNeItYNQRvpqIqPM/Y+g88iSObufmG6V9QBeuZmrNKxTRPmjbwTxfdzhjZC8zBcYrS8MoWaaEim5eWh1+6D6L5iTkZqhnHSD/2soic0TZKf0dfCYqr257SabfDKteJo/BrIhnaHAYgPE5SacrE/iozI+IIzrMxFdZ9Hj1ZmXrzgumSNckXpstSySKvXJbgI5XoElW3Kkbbz9FuUba7/DH1qt9Eb9wXZtENcj7gcK+bVuTx9dY3daXqpYEIYCSeoaQgi8LhJebFrnzvCLz7XbRiyAl1bH6fwHWiDU8LL1h6ZXEbx9AJe6iR jmiller@GBH87N"
          - "terraform"   = "true"
        } -> null
      - metadata_fingerprint       = "P2U4yKiZJRg=" -> null
      - metadata_startup_script    = <<-EOT
            #!/bin/bash
            
            # Log all output
            exec 1> >(logger -s -t $(basename $0)) 2>&1
            
            # Exit on error
            set -e
            
            # Set hostname immediately at boot time
            hostnamectl set-hostname solana-validator-gcp-0
            echo "solana-validator-gcp-0" > /etc/hostname
            echo "127.0.1.1 solana-validator-gcp-0" >> /etc/hosts
            
            # Log hostname setting
            mkdir -p /var/log
            echo "$(date '+%Y-%m-%d %H:%M:%S') - Setting hostname to solana-validator-gcp-0 at boot time" >> /var/log/hostname_setup.log
            
            mkdir -p /etc/salt/minion.d
            # Write Salt minion configuration
            cat > /etc/salt/minion << EOF
            master: salt-master.aws.miller.center
            id: solana-validator-gcp-0
            random_id: false
            hash_type: sha256
            log_level: debug
            EOF
            
            # Write minion_id file explicitly
            echo "solana-validator-gcp-0" > /etc/salt/minion_id
            
            # Install Salt
            # Ensure keyrings dir exists
            mkdir -p /etc/apt/keyrings
            # Download public key
            curl -fsSL https://packages.broadcom.com/artifactory/api/security/keypair/SaltProjectKey/public | tee /etc/apt/keyrings/salt-archive-keyring.pgp
            # Create apt repo target configuration
            curl -fsSL https://github.com/saltstack/salt-install-guide/releases/latest/download/salt.sources | tee /etc/apt/sources.list.d/salt.sources
            
            apt-get update
            apt-get install -y python3-pip awscli jq
            DEBIAN_FRONTEND=noninteractive apt-get -o Dpkg::Options::="--force-confold" -o Dpkg::Options::="--force-confdef" -y --no-install-recommends install salt-minion
            
            # Install Vault extension
            /opt/saltstack/salt/bin/pip3 install saltext-vault
            sleep 30
            systemctl restart salt-minion
        EOT -> null
      - name                       = "solana-validator-gcp-0" -> null
      - project                    = "solval1" -> null
      - resource_policies          = [] -> null
      - self_link                  = "https://www.googleapis.com/compute/v1/projects/solval1/zones/us-central1-a/instances/solana-validator-gcp-0" -> null
      - tags                       = [
          - "salt-minion",
          - "solana",
          - "terraform",
          - "testnet",
          - "validator",
          - "validator-0",
        ] -> null
      - tags_fingerprint           = "79kFdwymVH4=" -> null
      - terraform_labels           = {} -> null
      - zone                       = "us-central1-a" -> null
        # (4 unchanged attributes hidden)

      - attached_disk {
          - device_name                = "persistent-disk-1" -> null
          - mode                       = "READ_WRITE" -> null
          - source                     = "https://www.googleapis.com/compute/v1/projects/solval1/zones/us-central1-a/disks/solana-validator-gcp-0-data" -> null
            # (3 unchanged attributes hidden)
        }

      - boot_disk {
          - auto_delete                = true -> null
          - device_name                = "persistent-disk-0" -> null
          - mode                       = "READ_WRITE" -> null
          - source                     = "https://www.googleapis.com/compute/v1/projects/solval1/zones/us-central1-a/disks/solana-validator-gcp-0" -> null
            # (4 unchanged attributes hidden)

          - initialize_params {
              - enable_confidential_compute = false -> null
              - image                       = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-2204-jammy-v20250305" -> null
              - labels                      = {} -> null
              - provisioned_iops            = 0 -> null
              - provisioned_throughput      = 0 -> null
              - resource_manager_tags       = {} -> null
              - resource_policies           = [] -> null
              - size                        = 100 -> null
              - type                        = "pd-ssd" -> null
                # (1 unchanged attribute hidden)
            }
        }

      - network_interface {
          - internal_ipv6_prefix_length = 0 -> null
          - name                        = "nic0" -> null
          - network                     = "https://www.googleapis.com/compute/v1/projects/solval1/global/networks/solana-network" -> null
          - network_ip                  = "172.16.2.198" -> null
          - queue_count                 = 0 -> null
          - stack_type                  = "IPV4_ONLY" -> null
          - subnetwork                  = "https://www.googleapis.com/compute/v1/projects/solval1/regions/us-central1/subnetworks/solana-subnet" -> null
          - subnetwork_project          = "solval1" -> null
            # (4 unchanged attributes hidden)

          - access_config {
              - nat_ip                 = "34.123.170.254" -> null
              - network_tier           = "PREMIUM" -> null
                # (1 unchanged attribute hidden)
            }
        }

      - scheduling {
          - automatic_restart           = false -> null
          - availability_domain         = 0 -> null
          - instance_termination_action = "STOP" -> null
          - min_node_cpus               = 0 -> null
          - on_host_maintenance         = "TERMINATE" -> null
          - preemptible                 = true -> null
          - provisioning_model          = "SPOT" -> null
        }

      - service_account {
          - email  = "validator-sa@solval1.iam.gserviceaccount.com" -> null
          - scopes = [
              - "https://www.googleapis.com/auth/devstorage.read_write",
            ] -> null
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

  # module.instances.null_resource.salt_minion_provisioner["gcp-validator"] will be destroyed
  # (because key ["gcp-validator"] is not in for_each map)
  - resource "null_resource" "salt_minion_provisioner" {
      - id       = "6450001183801750158" -> null
      - triggers = {
          - "instance_ip" = "34.123.170.254"
        } -> null
    }

Plan: 0 to add, 1 to change, 9 to destroy.

Changes to Outputs:
  ~ instances          = {
      ~ aws         = {
          ~ validator   = {
              - dns        = null
              - private_ip = null
              - public_ip  = null
              - r53_record = null
            } -> null
            # (1 unchanged attribute hidden)
        }
      ~ gcp         = {
          ~ validator   = {
              - dns        = "34.123.170.254"
              - private_ip = "172.16.2.198"
              - public_ip  = "34.123.170.254"
              - r53_record = {
                  - fqdn = "solana-validator-gcp-0.aws.miller.center"
                  - ip   = "34.123.170.254"
                }
            } -> null
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged attribute hidden)
    }
```
</details>
<!-- placeholder-5 -->
<!-- terraform-9-cde32ffe5e278c0451f28026b6e4e399.tfplan -->
<!-- placeholder-6 -->